LightUpInc/lightup-arduino-plugin/arduino-plugin/hardware/lightup/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

###############################################################

lightup.name=LightUp
lightup.upload.tool=arduino:avrdude
lightup.upload.protocol=avr109
lightup.upload.maximum_size=28672
lightup.upload.maximum_data_size=2560
lightup.upload.speed=57600
lightup.upload.disable_flushing=true
lightup.upload.use_1200bps_touch=true
lightup.upload.wait_for_upload_port=true

lightup.bootloader.tool=arduino:avrdude
lightup.bootloader.low_fuses=0xff
lightup.bootloader.high_fuses=0xd8
lightup.bootloader.extended_fuses=0xcb
lightup.bootloader.file=lightup/LightUp.hex
lightup.bootloader.unlock_bits=0x3F
lightup.bootloader.lock_bits=0x2F

lightup.build.mcu=atmega32u4
lightup.build.f_cpu=8000000L
lightup.build.vid=0x1d50
lightup.build.pid=0x6096
lightup.build.usb_manufacturer="LightUp"
lightup.build.usb_product="LightUp"
lightup.build.board=AVR_LEONARDO
lightup.build.core=arduino:arduino
lightup.build.variant=arduino:leonardo
lightup.build.extra_flags={build.usb_flags}

